var newTaskList =
[
{id:"B", title:"Мінімізація гальмуючих факторів для соціо-економічного розвитку України",note:"	Послідовність дій влади, спрямованих на мінімізацію Топ-5 гальмуючих факторів для соціо-економічного розвитку України на часовому відрізку 2016-2020 роки"},
{id:"B.1", title:"Частка тіньової економіки  (% від ВВП)",  
	income:"2015:48.0:48%, 2016:47.0, 2020:70.0:70% (Графік прибутків для прикладу)",
	outcome:"2015:0.52:52%, 2016:0.47, 2020:0.25: Очікувана в 2020р. частка тіньової економіки 25%",note:""},
{id:"B.1.1", title:"Реформування податкової системи", start:	2016	, end:	2017	, note:"Для стрімкого росту економіки України, податок на прибуток для фізичних осіб має бути встановлено за прогресивною шкалою в діапазоні від 5% для низьких прибутків до 17% для високих. Для юридичних осіб – в діапазоні 15%-17%. Податок з обороту – в діапазоні 3%-5%. Податок від доходів, пов’язаних з володінням нерухомістю має бути встановлено за ставкою, що не перевищує 15%. ПДВ має бути скасовано. Лібералізація податкової системи має проводитися одночасно з підвищенням відповідальності фізичних і юридичних осіб за порушення податкового законодавства.	"},
{id:"B.1.2", 
	causes:"2017:B.1.1:2020, 2017:B.2.1:2020 , 2017:B.2.2:2020, 2018:B.4.2:2021:+",
	title:"Перехід до цивілізованого ринку землі", start:	2020	,note:"Оскільки ринок землі в сучасній Україні є тіньовим і непрозорим, ця обставина призводить до вилучення з національної економіки від 15% до 20% від ВВП. Олігархічний, латіффундістский устрій аграрного сектора України, який сконцентрував десятки і сотні тисяч гектарів землі, не дає можливості розвитку малим і середнім фермерським господарствам (ділянки землі від декількох гектарів до декількох сотень гектарів). Він унеможливлює конкуренцію і перехід аграрного сектора України на високотехнологічні уклади задля виробництва продуктів харчування високих ступеней переробки. Ці обставини впритул наблизили Україну до переходу на цивілізований, підконтрольний державі і прозорий для громадянського суспільства, ринку землі. Такий перехід, який для умов України може продовжуватися в часі від 5 до 15 років, потребує системного вирішення ряду нових проблем: створення локальної фінансово кредитної системи для АПК, включаючи земельний банк; створення системи страхування для АПК; за прикладом Японії, підтримки малих і середніх фермерських господарств, діяльність яких має координуватися кооперативними утвореннями; перехід АПК на вищі технологічні уклади з метою виробництва якісних продуктів харчування високих ступеней переробки.	"},
{id:"B.2", title:"Масштаб корупції (% від ВВП)",  outcome:"	2015:0.14:m, 2016:0.13,2020:0.04:m	",note:""},
{id:"B.2.1", title:"Масштабна лібералізація економіки", start:	2016	, end:	2017	,note:"скасування більшості узгоджувальних інстанцій в економіці і суспільстві, зменшення кількості службовців цих ланок від 30% до 40%.	"},
{id:"B.2.2", title:"Введення відкритих електронних форм звітності", start:	2016	, end:	2017,note:"	Введення відкритих в інформаційному просторі електронних форм звітності стосовно прибутків та видатків державних службовців, близьких членів їх сімей та осіб, що до них прирівнюються.	"},
{id:"B.2.3", title:"Посилення відповідальності за ухилення від публічної звітності", start:	2016	, end:	2017	,note:"	Посилення відповідальності за ухилення від публічної звітності про отримані прибутки та здійснені видатки для осіб, що пов’язані з державною службою, для близьких членів їх сімей, або до осіб, що до них прирівнюються.	"},
{id:"B.3", title:"Пенсійне навантаження на бюджет (% від ВВП)",outcome:"	2015:0.04:m, 2016:0.041,2020:0.021:m	",note:"		"},
{id:"B.3.1", title:"Введення паралельно з солідарною пенсійною системою накопичувальної пенсійної системи", start:	2016	, end:	2019	, note:"Введення паралельно з солідарною пенсійною системою накопичувальної пенсійної системи та створення фінансових інститутів (можливо з участю іноземних учасників) для гарантування та страхування накопичуваних пенсійних вкладів населення.	"},
{id:"B.4", title:"Обслуговування державного боргу   (% від ВВП)", outcome:"	2015:0.0869:m, 2016:0.074,2020:0.029:m	",note:"		"},
{id:"B.4.1", title:"Укладання з кредиторами договорів про зміну умов боргу", start:	2016	, end:	2017	, note:"	Для послаблення боргового тиску на бюджет та платіжний баланс, а також створення умов для економічного зростання, виконавчим органам влади доцільно досягти укладання з кредиторами договорів про зміну умов боргу на умовах зниження виплат та обміну боргових зобов’язань країни на її активи;	"},
{id:"B.4.2", title:"Реструктуризація державної заборгованості", start:	2016	, end:	2018	,note:"	Шляхом досягнення домовленостей з міжнародними кредиторами необхідно забезпечити реструктуризацію державної заборгованості з її концентрацією на внутрішні кредитні ресурси, довгострокові позики із фіксованими відсотковими ставками, суттєве зменшення гарантованих державою боргів, збереження оптимальних рівнів заборгованості відносно ВВП, використання державних запозичень на інвестування з метою розвитку національної економіки та орієнтацію на фінансування активних державних видатків	"},
{id:"B.5", title:"Енергомісткість ВВП України  (кг.н.е./дол. США)", outcome:"	2015:0.338:m, 2016:0.328,2020:0.18:m	",note:"		"},
{id:"B.5.1", 
causes:"2017.1:B.5.2:2019:-",
title:"Зменшення енергоємності ВВП", start:	2016	, end:	2020	,note:"	 Для зменшення енергоємності ВВП в Україні і, як наслідок, зниження собівартості продукції та підвищення її конкурентоздатності в державі необхідно  здійснити  низку дій за  такими  напрямами [Б. В. Слупський, завдання впровадження Європейських норм і стандартів з Енергоефективності та Енергозбереження в Україні, Механізми державного    управління, 2010, с. 97-99]: 	"},
{id:"B.5.2", 
causes:"2017.2:B.5.1:2019:+",
title:"Перехід   економіки  на \"інтелектуальні\"  технології", start:	2016	, end:	2020	,note:"	Поступовий  перехід  української  економіки  на \"інтелектуальні\"  технології  (комп'ютерні,  телекомунікаційні, біогенні та ін.) як менш енергоємні,  більш високорентабельні і екологічно чисті.	"}]



var parseTimeline = require("../wdc-xlsx-converter").parseXLSTimeline

var timeline = parseTimeline("timeline531.xlsx")
// console.log(timeline);

var res = require("../wdc-timeline").createSerie(timeline.data,"","",[2015,2024]);
console.log("var taskTree = " + JSON.stringify(res));
